/*
Снизить цены книг, цена которых больше 600 рублей, на 20%. Вывести информацию о книгах, скидку (столбец sale_20) и цену книги со скидкой (price_sale). 
Результаты округлить до двух знаков после запятой.
Для тех книг, на которые скидка не действует, в последних двух столбцах вывести символ  "-".  Отсортировать информацию сначала по фамилии автора, а потом по названию книги.
*/

SELECT 
      author,
      title,
      price,
      amount,
      IF(price > 600, ROUND(price*0.2,2), "-") as sale_20,
      IF(price > 600, ROUND(price*0.8,2), "-") as price_sale

FROM book  

ORDER BY 1,2;
